using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Text.RegularExpressions;

namespace GnPlatForm.SqlServer
{
    public partial class MySqlConvert0
    {
        public static string getServiceType(object value)
        {
            string servicetype = null;
            int len = Service_Type.GetUpperBound(0) + 1;
            for (int i = 0; i < len; i++)
            {
                if (Service_Type[i, 1].ToString() == value.ToString())
                    servicetype = Service_Type[i, 0].ToString();
            }
            return servicetype;
        }


        public static string getSubServiceType(object value)
        {
            string servicetype = null;
            int len = Service_Type.GetUpperBound(0) + 1;
            for (int i = 0; i < len; i++)
            {
                if (Service_Type[i, 3].ToString() == value.ToString())
                    servicetype = Service_Type[i, 2].ToString();
            }
            return servicetype;
        }

        private static object[,] Service_Type = new object[,]{
        {"普通下载",2,"WAP下载",6},
        {"普通下载",2,"Http下载",7},
        {"普通下载",2,"移动手机下载",3000},
        {"彩信",1,"彩信发送",4},
        {"彩信",1,"彩信接收",5},
        {"手机邮箱",20,"QQ邮箱",100},
        {"手机邮箱",20,"139邮箱",101},
        {"手机邮箱",20,"163邮箱",102},
        {"手机邮箱",20,"126邮箱",103},
        {"手机邮箱",20,"雅虎邮箱",104},
        {"手机邮箱",20,"Gmail",105},
        {"手机邮箱",20,"TOM邮箱",106},
        {"手机邮箱",20,"搜狐邮箱",107},
        {"即时消息",21,"手机QQ",200},
        {"即时消息",21,"手机飞信",201},
        {"即时消息",21,"手机MSN",202},
        {"即时消息",21,"米聊",203},
        {"即时消息",21,"微信",204},
        {"手机阅读",22,"QQ阅读",300},
        {"手机阅读",22,"移动手机阅读",301},
        {"手机阅读",22,"GGBOOK",302},
        {"手机微博",23,"新浪微博",400},
        {"手机微博",23,"腾讯微博",401},
        {"手机微博",23,"网易微博",402},
        {"手机微博",23,"搜狐微博",403},
        {"手机网购",24,"拍拍网",500},
        {"手机网购",24,"淘宝网",501},
        {"手机网购",24,"淘宝商城",502},
        {"手机网购",24,"当当网",503},
        {"手机网购",24,"京东商城",504},
        {"手机网购",24,"卓越亚马逊",505},
        {"手机网购",24,"凡客网",506},
        {"手机网购",24,"高朋网",507},
        {"手机网购",24,"赶集网",508},
        {"手机网购",24,"满座网",509},
        {"手机网购",24,"美团网",510},
        {"手机网购",24,"拉手网",511},
        {"手机网购",24,"百姓网",512},
        {"手机视频",25,"优酷网",600},
        {"手机视频",25,"移动手机电视",601},
        {"手机视频",25,"GG视频",602},
        {"手机视频",25,"友度网",603},
        {"手机视频",25,"土豆网",604},
        {"手机视频",25,"酷六网",605},
        {"手机视频",25,"激动网",606},
        {"手机视频",25,"VFUN手机视频",607},
        {"手机视频",25,"我乐网",608},
        {"手机音乐",26,"QQ音乐",700},
        {"手机音乐",26,"移动随身听",701},
        {"手机音乐",26,"GGMusic",702},
        {"手机地图",27,"谷歌地图",800},
        {"手机地图",27,"百度地图",801},
        {"手机地图",27,"图吧地图",802},
        {"手机游戏",28,"QQ游戏",900},
        {"手机游戏",28,"移动游戏",901},
        {"手机证券",29,"大智慧",1000},
        {"手机证券",29,"移动证券",1001},
        {"手机证券",29,"GG财神爷",1002},
        {"手机证券",29,"同花顺",1003},
        {"P2P下载",30,"BT下载",1100},
        {"P2P下载",30,"电驴下载",1101},
        {"应用商店",31,"安卓电子市场",1200},
        {"应用商店",31,"iPhone电子市场",1201},
        {"网页浏览",8001,"腾讯网",3001},
        {"网页浏览",8001,"QQ商城",3002},
        {"网页浏览",8001,"QQ朋友网",3003},
        {"网页浏览",8001,"QQ空间",3004},
        {"网页浏览",8001,"移动梦网",3005},
        {"网页浏览",8001,"移动快讯",3006},
        {"网页浏览",8001,"新浪网",3007},
        {"网页浏览",8001,"3G门户",3008},
        {"网页浏览",8001,"乐讯网",3009},
        {"网页浏览",8001,"宜搜小说",3010},
        {"网页浏览",8001,"百度",3011},
        {"网页浏览",8001,"谷歌",3012},
        {"网页浏览",8001,"搜搜",3013},
        {"网页浏览",8001,"UC门户",3014},
        {"网页浏览",8001,"UC网盘",3015},
        {"网页浏览",8001,"手机飞信网",3016},
        {"网页浏览",8001,"凤凰网",3017},
        {"网页浏览",8001,"网易",3018},
        {"网页浏览",8001,"搜狐网",3019},
        {"网页浏览",8001,"91手机娱乐门户",3020},
        {"网页浏览",8001,"搜狗",3021},
        {"网页浏览",8001,"空中网",3022},
        {"网页浏览",8001,"手机娱乐门户",3023},
        {"网页浏览",8001,"智乐网",3024},
        {"网页浏览",8001,"系统之家",3025},
        {"网页浏览",8001,"微软",3026},
        {"网页浏览",8001,"天天动听",3027},
        {"网页浏览",8001,"酷狗",3028},
        {"网页浏览",8001,"书旗网",3029},
        {"网页浏览",8001,"泡看小说网",3030},
        {"网页浏览",8001,"起点小说网",3031},
        {"网页浏览",8001,"16K小说网",3032},
        {"网页浏览",8001,"人人网",3033},
        {"网页浏览",8001,"开心网",3034},
        {"网页浏览",8001,"豆瓣",3035},
        {"网页浏览",8001,"掌上猫扑",3036},
        {"网页浏览",8001,"掌上天涯",3037},
        {"网页浏览",8001,"ADMOB手机广告",3038},
        {"网页浏览",8001,"360安全卫士",3039},
        {"网页浏览",8001,"蚂蚁秀",3040},
        {"网页浏览",8001,"天网",3041},
        {"网页浏览",8001,"诺基亚",3042},
        {"网页浏览",8001,"墨迹天气",3043},
        {"网页浏览",8001,"冒泡网",3044},
        {"网页浏览",8001,"开心听",3045},
        {"网页浏览",8001,"九游网",3046},
        {"网页浏览",8001,"冰冰手机影视",3047},
        {"网页浏览",8001,"xz.xlstk.com",3048},
        {"网页浏览",8001,"video.6hng.info",3049},
        {"网页浏览",8001,"ucs2.wapbao.com:81",3050},
        {"网页浏览",8001,"seeuji.com",3051},
        {"网页浏览",8001,"dy.binpda.cn",3052},
        {"网页浏览",8001,"c2.cmvideo.cn:8000",3053},
        {"网页浏览",8001,"61.143.3.219:21987",3054},
        {"网页浏览",8001,"58.248.255.20:8080",3055},
        {"网页浏览",8001,"58.211.14.58:10009",3056},
        {"网页浏览",8001,"221.181.100.20:8080:8080",3057},
        {"网页浏览",8001,"221.181.100.20:8080",3058},
        {"网页浏览",8001,"221.179.57.68:21987",3059},
        {"网页浏览",8001,"221.179.35.77",3060},
        {"网页浏览",8001,"221.179.35.76:80",3061},
        {"网页浏览",8001,"221.179.35.76",3062},
        {"网页浏览",8001,"221.179.35.75:80",3063},
        {"网页浏览",8001,"221.179.35.75",3064},
        {"网页浏览",8001,"221.179.35.70:80",3065},
        {"网页浏览",8001,"221.179.35.70",3066},
        {"网页浏览",8001,"221.179.35.69:80",3067},
        {"网页浏览",8001,"221.179.35.69",3068},
        {"网页浏览",8001,"221.179.35.68:80",3069},
        {"网页浏览",8001,"221.179.35.68",3070},
        {"网页浏览",8001,"221.179.35.67:80",3071},
        {"网页浏览",8001,"221.179.35.67",3072},
        {"网页浏览",8001,"221.179.35.66",3073},
        {"网页浏览",8001,"221.130.4.87:80",3074},
        {"网页浏览",8001,"218.200.160.30",3075},
        {"网页浏览",8001,"218.200.160.10",3076},
        {"网页浏览",8001,"211.140.17.83",3077},
        {"网页浏览",8001,"211.139.188.53:8899",3078},
        {"网页浏览",8001,"211.139.188.52:8899",3079},
        {"网页浏览",8001,"121.14.79.158",3080},
        {"网页浏览",8001,"120.197.84.134:8080",3081},
        {"网页浏览",8001,"120.197.84.133",3082},
        {"网页浏览",8001,"120.196.212.46:8080",3083},
        {"网页浏览",8001,"120.196.212.23:8080",3084},
        {"网页浏览",8001,"120.196.211.7",3085},
        {"网页浏览",8001,"120.196.211.49",3086},
        {"网页浏览",8001,"120.196.211.33",3087},
        {"网页浏览",8001,"120.196.211.148:8080",3088},
        {"网页浏览",8001,"120.196.211.147:8080",3089},
        {"网页浏览",8001,"120.196.211.142:8080",3090},
        {"网页浏览",8001,"120.196.211.103:8080",3091},
        {"网页浏览",8001,"120.193.10.230:80",3092},
        {"网页浏览",8001,"120.193.10.228:80",3093},
        {"网页浏览",8001,"120.193.10.132",3094},
        {"网页浏览",8001,"117.135.148.24",3095},
        {"网页浏览",8001,"117.135.138.237:8080",3096},
        {"网页浏览",8001,"117.135.129.180",3097},                  
       };
       
    }
}
